[
    {
        "Year": "563 BC",
        "Date": "",
        "Event": "The Gautama Buddha is born in Kapilvastu, Lumbini (present-day Nepal)."
    },
    {
        "Year": "268 BC",
        "Date": "",
        "Event": "Ashoka establishes empire in north India (to 231 BC)"
    },
    {
        "Year": "353",
        "Date": "",
        "Event": "Samudragupta establishes empire in north India"
    },
    {
        "Year": "400",
        "Date": "",
        "Event": "Licchavi kingdom in power in Kathmandu Valley (to 750)"
    },
    {
        "Year": "750",
        "Date": "",
        "Event": "\"Transitional\" kingdom in power in Kathmandu Valley (to 1200)"
    },
    {
        "Year": "1100",
        "Date": "",
        "Event": "Malla kings rule in western Nepal (to 1484)"
    },
    {
        "Year": "1200",
        "Date": "",
        "Event": "Aridev malla, first monarch of the Malla Dynasty, rules in Kathmandu Valley (to 1216)"
    },
    {
        "Year": "1312",
        "Date": "",
        "Event": "Newar king Ripumalla leads raid in Kathmandu Valley"
    },
    {
        "Year": "1345",
        "Date": "",
        "Event": "Sultan Shams ud-din Ilyas of Bengal leads raid in Kathmandu Valley (to 1346)"
    },
    {
        "Year": "1382",
        "Date": "",
        "Event": "Jayasthitimalla rules as king of united Malla kingdom in Kathmandu Valley (to 1395)"
    },
    {
        "Year": "1428",
        "Date": "",
        "Event": "Yakshamalla reigns – height of united Malla kingdom (to 1482)"
    },
    {
        "Year": "1484",
        "Date": "",
        "Event": "Malla kingdom divided; three kingdoms of Kathmandu, Bhadgaon, and Patan expand"
    },
    {
        "Year": "1526",
        "Date": "",
        "Event": "Mughal Empire established in north India"
    },
    {
        "Year": "1559",
        "Date": "",
        "Event": "Gorkha kingdom established"
    },
    {
        "Year": "1606",
        "Date": "",
        "Event": "Ram Shah of Gorkha reigns; Gorkha kingdom experiences first expansion (to 1633)"
    },
    {
        "Year": "1743",
        "Date": "",
        "Event": "Prithvi Narayan Shah ascends to throne of Gorkha"
    },
    {
        "Year": "1764",
        "Date": "",
        "Event": "British East India Company gains control of Bengal"
    },
    {
        "Year": "1768",
        "Date": "",
        "Event": "Gorkha ruler Prithvi Narayan Shah conquers Kathmandu and lays foundations for unified kingdom."
    },
    {
        "Year": "1769",
        "Date": "",
        "Event": "Conquest of Chaudandi and Majh Kirant states."
    },
    {
        "Year": "1792",
        "Date": "",
        "Event": "Nepalese expansion halted by defeat at hands of Chinese in Tibet."
    },
    {
        "Year": "1806",
        "Date": "",
        "Event": "Bhimsen Thapa becomes prime minister"
    },
    {
        "Year": "1809",
        "Date": "",
        "Event": "Nepalese troops lay siege to Kangra, farthest extent of Gurkha empire"
    },
    {
        "Year": "1814",
        "Date": "",
        "Event": "Anglo-Nepalese War; culminates in treaty which establishes Nepal's current boundaries. (to 1816)"
    },
    {
        "Year": "1837",
        "Date": "",
        "Event": "Bhimsen Thapa falls, beginning unstable period in court politics"
    },
    {
        "Year": "1846",
        "Date": "",
        "Event": "Nepal falls under sway of hereditary chief ministers known as Ranas, who dominate the monarchy and cut off country from outside world."
    },
    {
        "Year": "",
        "Date": "Kot Massacre takes place"
    },
    {
        "4": "1856",
        "5": "",
        "6": "Royal decree gives absolute power to prime minister and his family",
        "Year": "1855",
        "Date": "",
        "Event": "War waged with China (to 1858)"
    },
    {
        "Year": "1857",
        "Date": "",
        "Event": "Sepoy Rebellion waged against British in north India; Nepal aids British (to 1858)"
    },
    {
        "Year": "1858",
        "Date": "",
        "Event": "Jang Bahadur receives title of Rana"
    },
    {
        "Year": "1877",
        "Date": "",
        "Event": "Jang Bahadur Rana dies"
    },
    {
        "Year": "1885",
        "Date": "",
        "Event": "Ranoddip Singh Rana assassinated; Bir Shamser Rana becomes prime minister"
    },
    {
        "Year": "1901",
        "Date": "",
        "Event": "Dev Shamsher Rana forced to abdicate; Chandra Shamsher Rana becomes prime minister"
    },
    {
        "Year": "1914",
        "Date": "",
        "Event": "Thousands of Nepalese citizens fight as soldiers for British in World War I (to 1918)"
    },
    {
        "Year": "1923",
        "Date": "21 December",
        "Event": "Treaty with Britain affirms Nepal's sovereignty."
    },
    {
        "Year": "1935",
        "Date": "",
        "Event": "Praja Parishad established, first political party in Nepal"
    },
    {
        "Year": "1939",
        "Date": "",
        "Event": "Tens of thousands of Nepalese citizens fight as soldiers for British in World War II (to 1945)"
    },
    {
        "Year": "1947",
        "Date": "",
        "Event": "Nepali National Congress established through merger of former All-India Nepali National Congress with Nepalese Society of Banaras and Gorkha Congress of Calcutta"
    },
    {
        "Year": "1948",
        "Date": "",
        "Event": "Prime Minister Padma Shamsher Rana announces first constitution of Nepal, then resigns; his replacement, Mohan Shamsher Rana, represses opposition"
    },
    {
        "Year": "1950",
        "Date": "",
        "Event": "Anti-Rana forces based in India form alliance with monarch."
    },
    {
        "Year": "1951",
        "Date": "",
        "Event": "End of Rana rule. Sovereignty of crown restored and anti-Rana rebels in Nepalese Congress Party form government"
    },
    {
        "Year": "1952",
        "Date": "",
        "Event": "King Tribhuvan Bir Bikram Shah Dev ascends throne"
    },
    {
        "Year": "1953",
        "Date": "29 May",
        "Event": "New Zealander Edmund Hillary and Nepal's Sherpa Tenzing Norgay become the first climbers to reach the summit of Mount Everest."
    },
    {
        "Year": "1955",
        "Date": "",
        "Event": "Nepal joins the United Nations."
    },
    {
        "Year": "",
        "Date": "King Tribhuwan dies, King Mahendra ascends throne."
    },
    {
        "Year": "1959",
        "Date": "",
        "Event": "Multi-party constitution adopted; first general elections in Nepal bring to power Nepali Congress Party with B.P. Koirala as prime minister"
    },
    {
        "Year": "1960",
        "Date": "",
        "Event": "King Mahendra seizes control and suspends parliament, constitution and party politics after Nepali Congress Party (NCP) wins elections with B. P. Koirala as premier."
    },
    {
        "Year": "1962",
        "Date": "",
        "Event": "New constitution provides for non-party system of councils known as \"panchayat\" under which king exercises sole power. First elections to Rastrya Panchayat held in 1963."
    },
    {
        "Year": "1972",
        "Date": "",
        "Event": "King Mahendra dies, succeeded by Birendra."
    },
    {
        "Year": "1980",
        "Date": "",
        "Event": "Constitutional referendum follows agitation for reform. Small majority favours keeping existing panchayat system. King agrees to allow direct elections to national assembly – but on a non-party basis."
    },
    {
        "Year": "1985",
        "Date": "",
        "Event": "NCP begins civil disobedience campaign for restoration of multi-party system."
    },
    {
        "Year": "1986",
        "Date": "",
        "Event": ""
    },
    {
        "Year": "1989",
        "Date": "",
        "Event": "Trade and transit dispute with India leads to border blockade by Delhi resulting in worsening economic situation."
    },
    {
        "Year": "1990",
        "Date": "",
        "Event": "Pro-democracy agitation co-ordinated by NCP and leftist groups. Street protests suppressed by security forces resulting in deaths and mass arrests. King Birendra eventually bows to pressure and agrees to new democratic constitution. This protest time is called Jana Andolan I."
    },
    {
        "Year": "1991",
        "Date": "",
        "Event": "Nepali Congress Party wins first democratic elections. Girija Prasad Koirala becomes prime minister."
    },
    {
        "Year": "1994",
        "Date": "",
        "Event": "Koirala's government defeated in no-confidence motion. New elections lead to formation of Communist government."
    },
    {
        "Year": "1995",
        "Date": "",
        "Event": "Communist government dissolved."
    },
    {
        "Year": "",
        "Date": "Radical leftist group, the Nepal Communist Party (Maoist), begins insurrection in rural areas aimed at abolishing monarch and establishing people's republic, sparking a conflict that would drag on for over a decade."
    },
    {
        "Year": "1997",
        "Date": "",
        "Event": "Prime Minister Sher Bahadur Deuba loses no-confidence vote, ushering in period of increased political instability, with frequent changes of prime minister."
    },
    {
        "Year": "2000",
        "Date": "",
        "Event": "GP Koirala returns as prime minister, heading the ninth government in 10 years."
    },
    {
        "Year": "2001",
        "Date": "1 June",
        "Event": "King Birendra, Queen Aishwarya and other close relatives killed allegedly in shooting."
    },
    {
        "Year": "4 June",
        "Date": "Prince Gyanendra crowned King of Nepal ."
    },
    {
        "Year": "Jul",
        "Date": "Maoist rebels step up campaign of violence. Prime Minister GP Koirala quits over the violence; succeeded by Sher Bahadur Deuba."
    },
    {
        "Year": "Nov",
        "Date": "Maoists end four-month-old truce with government, declare peace talks with government failed. Launch coordinated attacks on army and police posts."
    },
    {
        "Year": "Nov",
        "Date": "State of emergency declared after more than 100 people are killed in four days of violence. King Gyanendra orders army to crush the Maoist rebels. Many hundreds are killed in rebel and government operations in the following months."
    },
    {
        "Year": "2002",
        "Date": "May",
        "Event": "Parliament dissolved, fresh elections called amid political confrontation over extending the state of emergency. Sher Bahadur Deuba heads interim government, renews emergency."
    },
    {
        "Year": "Oct",
        "Date": "King Gyanendra dismisses Deuba and indefinitely puts off elections set for November. Lokendra Bahadur Chand appointed as PM."
    },
    {
        "Year": "2003",
        "Date": "Jan",
        "Event": "Rebels, government declare ceasefire."
    },
    {
        "Year": "May",
        "Date": "Lokendra Bahadur Chand resigns as PM; king appoints his own nominee Surya Bahadur Thapa as new premier (to June)"
    },
    {
        "Year": "Aug",
        "Date": "Rebels pull out of peace talks with government and end seven-month truce. The following months see resurgence of violence and frequent clashes between students/activists and police."
    },
    {
        "Year": "2004",
        "Date": "Apr",
        "Event": "Nepal joins the World Trade Organisation (WTO)."
    },
    {
        "Year": "May",
        "Date": "Royalist Prime Minister Surya Bahadur Thapa resigns following weeks of street protests by opposition groups."
    },
    {
        "Year": "Jun",
        "Date": "King Gyanendra reappoints Sher Bahadur Deuba as prime minister with the task of holding elections."
    },
    {
        "Year": "2005",
        "Date": "1 February",
        "Event": "King Gyanendra dismisses Prime Minister Deuba and his government, declares a state of emergency and assumes direct power, citing the need to defeat Maoist rebels."
    },
    {
        "Year": "30 April",
        "Date": "King lifts the state of emergency amid international pressure."
    },
    {
        "Year": "Nov",
        "Date": "Maoist rebels and main opposition parties agree on a programme intended to restore democracy."
    },
    {
        "Year": "2006",
        "Date": "Apr",
        "Event": "King Gyanendra agrees to reinstate parliament following weeks of violent strikes and protests against direct royal rule. GP Koirala is appointed as prime minister. Maoist rebels call a three-month ceasefire. Some times this period is called Jana Andolan-II."
    },
    {
        "Year": "May",
        "Date": "Parliament votes unanimously to curtail the king's political powers. The government and Maoist rebels begin peace talks, the first in nearly three years."
    },
    {
        "Year": "16 June",
        "Date": "Rebel leader Chairman Prachanda and PM Koirala hold talks – the first such meeting between the two sides – and agree that the Maoists should be brought into an interim government."
    },
    {
        "Year": "Nov",
        "Date": "The government and Maoists sign a peace accord, declaring a formal end to a 10-year long People's War in Nepal. The rebels are to join a transitional government and their weapons will be placed under UN supervision."
    },
    {
        "Year": "2007",
        "Date": "Jan",
        "Event": "Maoist leaders enter parliament under the terms of a temporary constitution. Violent ethnic protests erupt in the south-east; demonstrators demand autonomy for the region."
    },
    {
        "Year": "Apr",
        "Date": "Former Maoist rebels join interim government, a move that takes them into the political mainstream."
    },
    {
        "Year": "May",
        "Date": "Elections for a constituent assembly pushed back to November."
    },
    {
        "Year": "May",
        "Date": "A US offer to resettle thousands of Bhutanese refugees in Nepal has raised hopes but has also sparked tension in the camps, says Human Rights Watch."
    },
    {
        "Year": "Sep",
        "Date": "Three bombs hit Kathmandu in the first attack in the capital since the end of the Maoist insurgency."
    },
    {
        "Year": "Sep",
        "Date": "Maoists quit interim government to press demand for monarchy to be scrapped. This forces the postponement of November's constituent assembly elections."
    },
    {
        "Year": "Oct",
        "Date": "UN Secretary-General Ban Ki-moon urges Nepal's parties to sink their differences to save the peace process."
    },
    {
        "Year": "Dec",
        "Date": "Parliament approves abolition of monarchy as part of peace deal with Maoists, who agree to re-join government."
    },
    {
        "Year": "2008",
        "Date": "Jan",
        "Event": "A series of bomb blasts kill and injure dozens in the southern Terai plains. Groups there have been demanding regional autonomy."
    },
    {
        "Year": "May",
        "Date": "Nepali Congress leader Bal Chandra Poudel attacked by maoists in Dandagaun, Rasuwa during election"
    },
    {
        "Year": "Apr",
        "Date": "Former Maoist rebels win the largest bloc of seats in elections to the new constituent assembly, but fail to achieve an outright majority."
    },
    {
        "Year": "28 May",
        "Date": "Nepal becomes a republic."
    },
    {
        "Year": "Jun",
        "Date": "Maoist ministers resign from the cabinet in a row over who should be the next head of state."
    },
    {
        "Year": "21 July",
        "Date": "Two months after the departure of King Gyanendra, Ram Baran Yadav becomes Nepal's first president."
    },
    {
        "Year": "15 August",
        "Date": "The Constituent Assembly elects the Maoist Chairman Pushpa Kamal Dahal 'Prachanda' as the first Prime Minister of Federal Democratic Republic of Nepal."
    },
    {
        "Year": "2009",
        "Date": "4 May",
        "Event": "Caught in row over dismissal of Nepal's army chief, country's Prime Minister Pushpa Kamal Dahal, also known as Prachanda, has resigned citing obstacle in government functioning as the main reason."
    },
    {
        "Year": "2015",
        "Date": "25 April",
        "Event": "The 7.8 Mw Ghorka earthquake affected the country with a maximum Mercalli intensity of IX (Violent). More than 10,000 people were killed."
    },
    {
        "Year": "2015",
        "Date": "20 September",
        "Event": "Promulgation of a new Constitution 2072 by President Dr. Ram Baran Yadav"
    }
]